 // - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);

 // -  Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
 //   EXAMPLE:
 //   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
 //   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
 //   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]

 //  Створити функцію яка приймає  пустий масив та :
 //        a. заповнює його 50 парними числами за допомоги циклу.
 //        b. заповнює його 50 непарними числами за допомоги циклу.
 //        c. заповнює масив 20ма рандомними числами. (Google: Generate random number JS)
 //        d. заповнює масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)

 //   Взяти з попереднього завдання будь який уже наповнений масив і Вивести за допомогою console.log кожен третій елемен
 //   Взяти з попереднього завдання будь який уже наповнений масив і  Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
 //   Взяти з попереднього завдання будь який уже наповнений масив і  Вивести кожен елемент масиву, сусід справа якого є парним
 //   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56

 // Створити функцію яка наповнює пустий масив рандомними значеннями, після наповнення помножити всі його елементи на 5 та перемістити їх в інший масив.

 //  Створити функцію яка риймає  масив: [ 'h', 'e', 'l', 'l', 'o', ' ' , 'w','o','r','l','d'] . I За допомогою циклу for зібрати всі букви в слово.

 // Створити функцю яка примйає  масив [2,17,13,6,22,31,45,66,100,-18] :
 // перебрати його циклом for та вивести  числа тільки з непарним індексом
 // перебратийого  циклом for та вивести  числа тільки парні  значення
 // замінити кожне число кратне 3 на слово "okten"